# Даны 2 действительных числа a и b. Получить их сумму, разность,
# произведение, возвести a в степень b,
# a поделить по модулю на b и выполнить целочисленное деление a на b.
a = 15
b = 6
print('Сумма a + b = ', a + b)
print('Разность a - b = ', a - b)
print('Произведение a * b = ', a * b)
print('a в степени b равно ', a ** b)
print('Деление числа a по модулю на число b равно', a % b)
print('Целочисленное деление a на b равно ', a // b)
